; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_10_8)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 - person
	)

  (:init
		(= (x b0) -2)
(= (y b0) 0)
(= (x b1) 7)
(= (y b1) 0)
(= (x b2) -9)
(= (y b2) 0)
(= (x b3) -1)
(= (y b3) 0)
(= (x b4) -9)
(= (y b4) 0)
(= (x b5) -5)
(= (y b5) 0)
(= (x b6) 10)
(= (y b6) 0)
(= (x b7) 4)
(= (y b7) 0)
(= (x b8) -6)
(= (y b8) 0)
(= (x b9) 9)
(= (y b9) 0)

		(= (d p0) 26)
(= (d p1) 62)
(= (d p2) 67)
(= (d p3) 77)
(= (d p4) 42)
(= (d p5) 6)
(= (d p6) 99)
(= (d p7) 49)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
		)
	)
)

; plan
1. (go_north_west b3)
   changed: (x b3) from -1 to -2.5, (y b3) from 0 to 1.5
   goals met: 0 of 8
2. (go_north_west b3)
   changed: (x b3) from -2.5 to -4, (y b3) from 1.5 to 3
   goals met: 0 of 8
3. (go_north_west b3)
   changed: (x b3) from -4 to -5.5, (y b3) from 3 to 4.5
   goals met: 0 of 8
4. (go_north_west b3)
   changed: (x b3) from -5.5 to -7, (y b3) from 4.5 to 6
   goals met: 0 of 8
5. (go_north_west b3)
   changed: (x b3) from -7 to -8.5, (y b3) from 6 to 7.5
   goals met: 0 of 8
6. (go_north_west b3)
   changed: (x b3) from -8.5 to -10, (y b3) from 7.5 to 9
   goals met: 0 of 8
7. (go_north_west b3)
   changed: (x b3) from -10 to -11.5, (y b3) from 9 to 10.5
   goals met: 0 of 8
8. (go_north_west b3)
   changed: (x b3) from -11.5 to -13, (y b3) from 10.5 to 12
   goals met: 0 of 8
9. (go_north_west b3)
   changed: (x b3) from -13 to -14.5, (y b3) from 12 to 13.5
   goals met: 0 of 8
10. (go_north_west b3)
   changed: (x b3) from -14.5 to -16, (y b3) from 13.5 to 15
   goals met: 0 of 8
11. (go_north_east b3)
   changed: (x b3) from -16 to -14.5, (y b3) from 15 to 16.5
   goals met: 0 of 8
12. (go_north_east b3)
   changed: (x b3) from -14.5 to -13, (y b3) from 16.5 to 18
   goals met: 0 of 8
13. (go_north_east b3)
   changed: (x b3) from -13 to -11.5, (y b3) from 18 to 19.5
   goals met: 0 of 8
14. (save_person b3 p5)
   added: (saved p5)
   goals met: 1 of 8
15. (go_north_west b3)
   changed: (x b3) from -11.5 to -13, (y b3) from 19.5 to 21
   goals met: 1 of 8
16. (go_north_west b3)
   changed: (x b3) from -13 to -14.5, (y b3) from 21 to 22.5
   goals met: 1 of 8
17. (go_north_west b3)
   changed: (x b3) from -14.5 to -16, (y b3) from 22.5 to 24
   goals met: 1 of 8
18. (go_north_west b3)
   changed: (x b3) from -16 to -17.5, (y b3) from 24 to 25.5
   goals met: 1 of 8
19. (go_north_west b3)
   changed: (x b3) from -17.5 to -19, (y b3) from 25.5 to 27
   goals met: 1 of 8
20. (go_north_west b3)
   changed: (x b3) from -19 to -20.5, (y b3) from 27 to 28.5
   goals met: 1 of 8
21. (go_north_east b3)
   changed: (x b3) from -20.5 to -19, (y b3) from 28.5 to 30
   goals met: 1 of 8
22. (go_north_east b3)
   changed: (x b3) from -19 to -17.5, (y b3) from 30 to 31.5
   goals met: 1 of 8
23. (go_north_east b3)
   changed: (x b3) from -17.5 to -16, (y b3) from 31.5 to 33
   goals met: 1 of 8
24. (go_north_east b3)
   changed: (x b3) from -16 to -14.5, (y b3) from 33 to 34.5
   goals met: 1 of 8
25. (go_north_east b3)
   changed: (x b3) from -14.5 to -13, (y b3) from 34.5 to 36
   goals met: 1 of 8
26. (go_north_east b3)
   changed: (x b3) from -13 to -11.5, (y b3) from 36 to 37.5
   goals met: 1 of 8
27. (save_person b3 p0)
   added: (saved p0)
   goals met: 2 of 8
28. (go_north_east b3)
   changed: (x b3) from -11.5 to -10, (y b3) from 37.5 to 39
   goals met: 2 of 8
29. (go_north_east b3)
   changed: (x b3) from -10 to -8.5, (y b3) from 39 to 40.5
   goals met: 2 of 8
30. (go_north_east b3)
   changed: (x b3) from -8.5 to -7, (y b3) from 40.5 to 42
   goals met: 2 of 8
31. (go_north_east b3)
   changed: (x b3) from -7 to -5.5, (y b3) from 42 to 43.5
   goals met: 2 of 8
32. (go_north_east b3)
   changed: (x b3) from -5.5 to -4, (y b3) from 43.5 to 45
   goals met: 2 of 8
33. (go_north_east b3)
   changed: (x b3) from -4 to -2.5, (y b3) from 45 to 46.5
   goals met: 2 of 8
34. (save_person b3 p4)
   added: (saved p4)
   goals met: 3 of 8
35. (go_north_east b3)
   changed: (x b3) from -2.5 to -1, (y b3) from 46.5 to 48
   goals met: 3 of 8
36. (go_north_east b3)
   changed: (x b3) from -1 to 0.5, (y b3) from 48 to 49.5
   goals met: 3 of 8
37. (save_person b3 p7)
   added: (saved p7)
   goals met: 4 of 8
38. (go_north_east b3)
   changed: (x b3) from 0.5 to 2, (y b3) from 49.5 to 51
   goals met: 4 of 8
39. (go_north_east b3)
   changed: (x b3) from 2 to 3.5, (y b3) from 51 to 52.5
   goals met: 4 of 8
40. (go_north_east b3)
   changed: (x b3) from 3.5 to 5, (y b3) from 52.5 to 54
   goals met: 4 of 8
41. (go_north_east b3)
   changed: (x b3) from 5 to 6.5, (y b3) from 54 to 55.5
   goals met: 4 of 8
42. (go_north_west b3)
   changed: (x b3) from 6.5 to 5, (y b3) from 55.5 to 57
   goals met: 4 of 8
43. (go_north_west b3)
   changed: (x b3) from 5 to 3.5, (y b3) from 57 to 58.5
   goals met: 4 of 8
44. (go_north_west b3)
   changed: (x b3) from 3.5 to 2, (y b3) from 58.5 to 60
   goals met: 4 of 8
45. (go_north_west b3)
   changed: (x b3) from 2 to 0.5, (y b3) from 60 to 61.5
   goals met: 4 of 8
46. (go_north_west b3)
   changed: (x b3) from 0.5 to -1, (y b3) from 61.5 to 63
   goals met: 4 of 8
47. (save_person b3 p1)
   added: (saved p1)
   goals met: 5 of 8
48. (go_north_east b3)
   changed: (x b3) from -1 to 0.5, (y b3) from 63 to 64.5
   goals met: 5 of 8
49. (go_north_east b3)
   changed: (x b3) from 0.5 to 2, (y b3) from 64.5 to 66
   goals met: 5 of 8
50. (go_north_west b3)
   changed: (x b3) from 2 to 0.5, (y b3) from 66 to 67.5
   goals met: 5 of 8
51. (save_person b3 p2)
   added: (saved p2)
   goals met: 6 of 8
52. (go_north_east b3)
   changed: (x b3) from 0.5 to 2, (y b3) from 67.5 to 69
   goals met: 6 of 8
53. (go_north_east b3)
   changed: (x b3) from 2 to 3.5, (y b3) from 69 to 70.5
   goals met: 6 of 8
54. (go_north_east b3)
   changed: (x b3) from 3.5 to 5, (y b3) from 70.5 to 72
   goals met: 6 of 8
55. (go_north_west b3)
   changed: (x b3) from 5 to 3.5, (y b3) from 72 to 73.5
   goals met: 6 of 8
56. (go_north_west b3)
   changed: (x b3) from 3.5 to 2, (y b3) from 73.5 to 75
   goals met: 6 of 8
57. (go_north_west b3)
   changed: (x b3) from 2 to 0.5, (y b3) from 75 to 76.5
   goals met: 6 of 8
58. (go_north_west b3)
   changed: (x b3) from 0.5 to -1, (y b3) from 76.5 to 78
   goals met: 6 of 8
59. (save_person b3 p3)
   added: (saved p3)
   goals met: 7 of 8
60. (go_north_east b3)
   changed: (x b3) from -1 to 0.5, (y b3) from 78 to 79.5
   goals met: 7 of 8
61. (go_north_east b3)
   changed: (x b3) from 0.5 to 2, (y b3) from 79.5 to 81
   goals met: 7 of 8
62. (go_north_east b3)
   changed: (x b3) from 2 to 3.5, (y b3) from 81 to 82.5
   goals met: 7 of 8
63. (go_north_east b3)
   changed: (x b3) from 3.5 to 5, (y b3) from 82.5 to 84
   goals met: 7 of 8
64. (go_north_east b3)
   changed: (x b3) from 5 to 6.5, (y b3) from 84 to 85.5
   goals met: 7 of 8
65. (go_north_east b3)
   changed: (x b3) from 6.5 to 8, (y b3) from 85.5 to 87
   goals met: 7 of 8
66. (go_north_east b3)
   changed: (x b3) from 8 to 9.5, (y b3) from 87 to 88.5
   goals met: 7 of 8
67. (go_north_east b3)
   changed: (x b3) from 9.5 to 11, (y b3) from 88.5 to 90
   goals met: 7 of 8
68. (go_north_west b3)
   changed: (x b3) from 11 to 9.5, (y b3) from 90 to 91.5
   goals met: 7 of 8
69. (go_north_west b3)
   changed: (x b3) from 9.5 to 8, (y b3) from 91.5 to 93
   goals met: 7 of 8
70. (go_north_west b3)
   changed: (x b3) from 8 to 6.5, (y b3) from 93 to 94.5
   goals met: 7 of 8
71. (go_north_west b3)
   changed: (x b3) from 6.5 to 5, (y b3) from 94.5 to 96
   goals met: 7 of 8
72. (go_north_west b3)
   changed: (x b3) from 5 to 3.5, (y b3) from 96 to 97.5
   goals met: 7 of 8
73. (go_north_west b3)
   changed: (x b3) from 3.5 to 2, (y b3) from 97.5 to 99
   goals met: 7 of 8
74. (go_north_west b3)
   changed: (x b3) from 2 to 0.5, (y b3) from 99 to 100.5
   goals met: 7 of 8
75. (save_person b3 p6)
   added: (saved p6)
   goals met: 8 of 8
